### Terraform plan 
<details><summary>Click to see the plan</summary>


```diff

[command]/home/runner/work/_temp/afe86f23-c81d-4199-9612-1a59819fd559/terraform-bin show -no-color plan.tmp

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.module.eks_managed_node_group["bottlerocket_default"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
      + arn                    = "arn:aws:eks:us-east-1:322620855520:nodegroup/aws-eks-cluster/bottlerocket_default-20240505194518689300000001/46c7a525-07d5-8a67-05fb-31f543eea734"
        id                     = "aws-eks-cluster:bottlerocket_default-20240505194518689300000001"
      + resources              = [
          + {
              + autoscaling_groups              = [
                  + {
                      + name = "eks-bottlerocket_default-20240505194518689300000001-46c7a525-07d5-8a67-05fb-31f543eea734"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ]
      + status                 = "CREATE_FAILED"
        tags                   = {
            "Name" = "bottlerocket_default"
        }
        # (7 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_policy.node_additional must be replaced
-/+ resource "aws_iam_policy" "node_additional" {
      ~ arn         = "arn:aws:iam::322620855520:policy/ex-prod-additional" -> (known after apply)
      ~ id          = "arn:aws:iam::322620855520:policy/ex-prod-additional" -> (known after apply)
      ~ name        = "ex-prod-additional" -> "aws-eks-cluster-additional" # forces replacement
      + name_prefix = (known after apply)
      ~ policy_id   = "ANPAUWHNTSTQPYFPH7SIV" -> (known after apply)
      ~ tags        = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          - "Name"       = "aws-eks-cluster" -> null
        }
      ~ tags_all    = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          - "Name"       = "aws-eks-cluster" -> null
        }
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role.this["multiple"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "Example"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ex-multiple"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all              = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.this["single"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "Example"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ex-single"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all              = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + unique_id             = (known after apply)
    }

  # aws_security_group.remote_access must be replaced
-/+ resource "aws_security_group" "remote_access" {
      ~ arn                    = "arn:aws:ec2:us-east-1:322620855520:security-group/sg-0cbd48329cc06be6f" -> (known after apply)
      ~ id                     = "sg-0cbd48329cc06be6f" -> (known after apply)
      ~ name                   = "ex-prod-remote-access2024050514492913260000000d" -> (known after apply)
      ~ name_prefix            = "ex-prod-remote-access" -> "aws-eks-cluster-remote-access" # forces replacement
      ~ owner_id               = "322620855520" -> (known after apply)
      ~ tags                   = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          ~ "Name"       = "ex-prod-remote" -> "aws-eks-cluster-remote"
        }
      ~ tags_all               = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          ~ "Name"       = "ex-prod-remote" -> "aws-eks-cluster-remote"
        }
        # (5 unchanged attributes hidden)
    }

  # module.aws-auth.kubernetes_config_map_v1_data.aws_auth[0] will be created
  + resource "kubernetes_config_map_v1_data" "aws_auth" {
      + data          = {
          + "mapAccounts" = <<-EOT
                - "322620855520"
            EOT
          + "mapRoles"    = jsonencode([])
          + "mapUsers"    = <<-EOT
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::322620855520:user/caio"
                  "username": "caio"
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::322620855520:root"
                  "username": "root"
            EOT
        }
      + field_manager = "Terraform"
      + force         = true
      + id            = (known after apply)

      + metadata {
          + name      = "aws-auth"
          + namespace = "kube-system"
        }
    }

  # module.ebs_kms_key.aws_kms_alias.this["eks/aws-eks-cluster/ebs"] will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/eks/aws-eks-cluster/ebs"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = "4170e498-9976-42d8-ac30-ea33f6423cda"
    }

  # module.ebs_kms_key.aws_kms_alias.this["eks/ex-prod/ebs"] will be destroyed
  # (because key ["eks/ex-prod/ebs"] is not in for_each map)
  - resource "aws_kms_alias" "this" {
      - arn            = "arn:aws:kms:us-east-1:322620855520:alias/eks/ex-prod/ebs" -> null
      - id             = "alias/eks/ex-prod/ebs" -> null
      - name           = "alias/eks/ex-prod/ebs" -> null
      - target_key_arn = "arn:aws:kms:us-east-1:322620855520:key/4170e498-9976-42d8-ac30-ea33f6423cda" -> null
      - target_key_id  = "4170e498-9976-42d8-ac30-ea33f6423cda" -> null
        # (1 unchanged attribute hidden)
    }

  # module.ebs_kms_key.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "4170e498-9976-42d8-ac30-ea33f6423cda"
      ~ tags                               = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          - "Name"       = "aws-eks-cluster" -> null
        }
      ~ tags_all                           = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          - "Name"       = "aws-eks-cluster" -> null
        }
        # (12 unchanged attributes hidden)
    }

  # module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.29"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.29"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.29"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "this" {
        id                = "/aws/eks/aws-eks-cluster/cluster"
        name              = "/aws/eks/aws-eks-cluster/cluster"
      ~ tags              = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
            "Name"       = "/aws/eks/aws-eks-cluster/cluster"
        }
      ~ tags_all          = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Example"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Example"
      + resource_id = (known after apply)
      + value       = "aws-eks-cluster"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["GithubOrg"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "GithubOrg"
      + resource_id = (known after apply)
      + value       = "terraform-aws-modules"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["GithubRepo"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "GithubRepo"
      + resource_id = (known after apply)
      + value       = "terraform-aws-eks"
    }

  # module.eks.aws_eks_access_entry.this["cluster_creator"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "aws-eks-cluster"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::322620855520:role/github-caiocsgomes-org"
      + tags              = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all          = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = "aws-eks-cluster"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::322620855520:role/github-caiocsgomes-org"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks.aws_eks_addon.before_compute["vpc-cni"] will be updated in-place
  ~ resource "aws_eks_addon" "before_compute" {
      ~ addon_version               = "v1.18.1-eksbuild.1" -> (known after apply)
        id                          = "aws-eks-cluster:vpc-cni"
      - service_account_role_arn    = "arn:aws:iam::322620855520:role/VPC-CNI-IRSA20240505145758169500000016" -> null
      ~ tags                        = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          - "Name"       = "aws-eks-cluster" -> null
        }
      ~ tags_all                    = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          - "Name"       = "aws-eks-cluster" -> null
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "coredns"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "aws-eks-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all                    = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "kube-proxy"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "aws-eks-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all                    = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_cluster.this[0] must be replaced
+/- resource "aws_eks_cluster" "this" {
      ~ arn                       = "arn:aws:eks:us-east-1:322620855520:cluster/aws-eks-cluster" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJRmcvVjlRQXdUYmd3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRBMU1EVXhORFE1TWpKYUZ3MHpOREExTURNeE5EVTBNakphTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUM1a1RvUk9RUjlkSTNjdkVrRlVYbHkxeDlSRnhWNXRPQmwxSjRBUVJ0ZmlJcnozMHk3V3R5ejdwNXoKdnpkRUV5amw0cXZyTUJCbHhFQ0l3YnV6YjhLNHdqbWd4MTF5bFB4em9tWi9DNkM2OGRjekRzTkVGVkRtM2R3bgprZEhRUnB1cHJCem1mcDAxV3NMRWtrM25YV0xwdVNvUi96ZEMrNmpUUy9aVHNlODJQUGlQQ2VRK3Zya0JBQ01DClU3MWZJZ29SSU5RVHRPdkI2MlpHeURlUm9KemU1U0NLZ1hNenlRanJjMGZJMTFGUm9La2QwclIwNDY0alFsNG8KRGluUWpZcjRUUEFYaExGS0hzaHhDUzNsMEx5dlJmeWhNYlpjWGJGY3lOV2RoeWRFTjE2TFlFU1J1SWpXbStHdQpBVU5hUlJESFA4RVpwVkVMMkxSQUs2ZmdqOXZWQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJUbVdnbDBBQ3BjVkt6TXZwdG1QY2xMRUJhS1F6QVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQ3lhTFZ1MzJKWApnK0wwME9zMU5jNXlDZlNTbDgrbHU3SkVMMlR4Zml6UzNGK0laSURPN1JKc0dFRWc5VTBEN1prQ3BzQks1eGk3CnRBWFVOU1d3aUJuRTdBTFZZdGVHSEF1Z3NvRnk4ZG5SVWNPRTFYSTBXb0ZJVGFRVUJNczVTc05SbXdXQjJUZG8Ka2lIZ29kVTBkL2VJSzJBRWxYa1FYekhyU0lZRVBrUk51MFJLMWRSOXdDNHpCeWgrYjBLMXBlZUNlNXljekE4ZApybnhxTFVmZnFEQ29DTzFVbUpRMlhZdFUrSGdlZWprdDhaRkNEZDc3S2lIaDZEY094bnJQbEFRM0xaT1Q1Z1QzCmIxQnZmWUJFVUFqZnhKNHdFZUxqWjhBc2NxUS9mdlozM3pqaFNLSEcrbjFlWlF5ZlY4UVZTNThBbmg3MU5TSnUKcXBlQ1IxMHNNRjNRCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> (known after apply)
      + cluster_id                = (known after apply)
      ~ created_at                = "2024-05-05 14:49:42.023 +0000 UTC" -> (known after apply)
      ~ endpoint                  = "https://B834912227C4F7EB5BEF7C2BA3F5E52A.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "aws-eks-cluster" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-1.amazonaws.com/id/B834912227C4F7EB5BEF7C2BA3F5E52A"
                    },
                ]
            },
        ] -> (known after apply)
        name                      = "aws-eks-cluster"
      ~ platform_version          = "eks.12" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      ~ tags                      = {
          + "Example"               = "aws-eks-cluster"
          + "GithubOrg"             = "terraform-aws-modules"
          + "GithubRepo"            = "terraform-aws-eks"
          - "Name"                  = "aws-eks-cluster" -> null
            "terraform-aws-modules" = "eks"
        }
      ~ tags_all                  = {
          + "Example"               = "aws-eks-cluster"
          + "GithubOrg"             = "terraform-aws-modules"
          + "GithubRepo"            = "terraform-aws-eks"
          - "Name"                  = "aws-eks-cluster" -> null
            # (1 unchanged element hidden)
        }
      ~ version                   = "1.28" -> "1.29"
        # (2 unchanged attributes hidden)

      ~ kubernetes_network_config {
          ~ ip_family         = "ipv4" -> "ipv6" # forces replacement
          ~ service_ipv4_cidr = "172.20.0.0/16" -> (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-01e715ec98e492f78" -> (known after apply)
          ~ subnet_ids                = [
              - "subnet-042c6bd1a2a15a8cf",
              - "subnet-08b01043cc3f0b294",
              - "subnet-0b8777df01db3bf68",
            ] -> (known after apply)
          ~ vpc_id                    = "vpc-00d0e04164e8b6ee2" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] must be replaced
-/+ resource "aws_iam_openid_connect_provider" "oidc_provider" {
      ~ arn             = "arn:aws:iam::322620855520:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/B834912227C4F7EB5BEF7C2BA3F5E52A" -> (known after apply)
      ~ id              = "arn:aws:iam::322620855520:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/B834912227C4F7EB5BEF7C2BA3F5E52A" -> (known after apply)
      ~ tags            = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          ~ "Name"       = "aws-eks-cluster" -> "aws-eks-cluster-eks-irsa"
        }
      ~ tags_all        = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          ~ "Name"       = "aws-eks-cluster" -> "aws-eks-cluster-eks-irsa"
        }
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
      ~ url             = "oidc.eks.us-east-1.amazonaws.com/id/B834912227C4F7EB5BEF7C2BA3F5E52A" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] will be updated in-place
  ~ resource "aws_iam_policy" "cluster_encryption" {
        id          = "arn:aws:iam::322620855520:policy/aws-eks-cluster-cluster-ClusterEncryption20240505144939335600000014"
        name        = "aws-eks-cluster-cluster-ClusterEncryption20240505144939335600000014"
      ~ tags        = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          - "Name"       = "aws-eks-cluster" -> null
        }
      ~ tags_all    = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          - "Name"       = "aws-eks-cluster" -> null
        }
        # (6 unchanged attributes hidden)
    }

  # module.eks.aws_iam_policy.cni_ipv6_policy[0] will be created
  + resource "aws_iam_policy" "cni_ipv6_policy" {
      + arn         = (known after apply)
      + description = "IAM policy for EKS CNI to assign IPV6 addresses"
      + id          = (known after apply)
      + name        = "AmazonEKS_CNI_IPv6_Policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeTags",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:AssignIpv6Addresses",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AssignDescribe"
                    },
                  + {
                      + Action   = "ec2:CreateTags"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:*:*:network-interface/*"
                      + Sid      = "CreateTags"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all    = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
    }

  # module.eks.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
        id                    = "aws-eks-cluster-cluster-20240505144916690300000003"
        name                  = "aws-eks-cluster-cluster-20240505144916690300000003"
      ~ tags                  = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          - "Name"       = "aws-eks-cluster" -> null
        }
      ~ tags_all              = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          - "Name"       = "aws-eks-cluster" -> null
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_security_group.cluster[0] will be updated in-place
  ~ resource "aws_security_group" "cluster" {
        id                     = "sg-0cc4de4db257e4556"
        name                   = "aws-eks-cluster-cluster-20240505144930093500000010"
      ~ tags                   = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
            "Name"       = "aws-eks-cluster-cluster"
        }
      ~ tags_all               = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_security_group.node[0] will be updated in-place
  ~ resource "aws_security_group" "node" {
        id                     = "sg-0d049238c746376cb"
        name                   = "aws-eks-cluster-node-2024050514492912940000000b"
      ~ tags                   = {
          + "Example"                               = "aws-eks-cluster"
          + "GithubOrg"                             = "terraform-aws-modules"
          + "GithubRepo"                            = "terraform-aws-eks"
            "Name"                                  = "aws-eks-cluster-node"
            "kubernetes.io/cluster/aws-eks-cluster" = "owned"
        }
      ~ tags_all               = {
          + "Example"                               = "aws-eks-cluster"
          + "GithubOrg"                             = "terraform-aws-modules"
          + "GithubRepo"                            = "terraform-aws-eks"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["egress_all"] must be replaced
+/- resource "aws_security_group_rule" "node" {
      ~ id                       = "sgrule-1678508575" -> (known after apply)
      + ipv6_cidr_blocks         = [ # forces replacement
          + "::/0",
        ]
      ~ security_group_rule_id   = "sgr-0e36ae1659f4df401" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.node["egress_all_self_efa"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node EFA"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = "sg-0d049238c746376cb"
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_all_self_efa"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node EFA"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = "sg-0d049238c746376cb"
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.eks.time_sleep.this[0] must be replaced
+/- resource "time_sleep" "this" {
      ~ id              = "2024-05-05T14:58:27Z" -> (known after apply)
      ~ triggers        = { # forces replacement
          ~ "cluster_certificate_authority_data" = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJRmcvVjlRQXdUYmd3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRBMU1EVXhORFE1TWpKYUZ3MHpOREExTURNeE5EVTBNakphTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUM1a1RvUk9RUjlkSTNjdkVrRlVYbHkxeDlSRnhWNXRPQmwxSjRBUVJ0ZmlJcnozMHk3V3R5ejdwNXoKdnpkRUV5amw0cXZyTUJCbHhFQ0l3YnV6YjhLNHdqbWd4MTF5bFB4em9tWi9DNkM2OGRjekRzTkVGVkRtM2R3bgprZEhRUnB1cHJCem1mcDAxV3NMRWtrM25YV0xwdVNvUi96ZEMrNmpUUy9aVHNlODJQUGlQQ2VRK3Zya0JBQ01DClU3MWZJZ29SSU5RVHRPdkI2MlpHeURlUm9KemU1U0NLZ1hNenlRanJjMGZJMTFGUm9La2QwclIwNDY0alFsNG8KRGluUWpZcjRUUEFYaExGS0hzaHhDUzNsMEx5dlJmeWhNYlpjWGJGY3lOV2RoeWRFTjE2TFlFU1J1SWpXbStHdQpBVU5hUlJESFA4RVpwVkVMMkxSQUs2ZmdqOXZWQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJUbVdnbDBBQ3BjVkt6TXZwdG1QY2xMRUJhS1F6QVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQ3lhTFZ1MzJKWApnK0wwME9zMU5jNXlDZlNTbDgrbHU3SkVMMlR4Zml6UzNGK0laSURPN1JKc0dFRWc5VTBEN1prQ3BzQks1eGk3CnRBWFVOU1d3aUJuRTdBTFZZdGVHSEF1Z3NvRnk4ZG5SVWNPRTFYSTBXb0ZJVGFRVUJNczVTc05SbXdXQjJUZG8Ka2lIZ29kVTBkL2VJSzJBRWxYa1FYekhyU0lZRVBrUk51MFJLMWRSOXdDNHpCeWgrYjBLMXBlZUNlNXljekE4ZApybnhxTFVmZnFEQ29DTzFVbUpRMlhZdFUrSGdlZWprdDhaRkNEZDc3S2lIaDZEY094bnJQbEFRM0xaT1Q1Z1QzCmIxQnZmWUJFVUFqZnhKNHdFZUxqWjhBc2NxUS9mdlozM3pqaFNLSEcrbjFlWlF5ZlY4UVZTNThBbmg3MU5TSnUKcXBlQ1IxMHNNRjNRCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)
          ~ "cluster_endpoint"                   = "https://B834912227C4F7EB5BEF7C2BA3F5E52A.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)
          ~ "cluster_service_cidr"               = "172.20.0.0/16" -> (known after apply)
          ~ "cluster_version"                    = "1.28" -> "1.29"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.key_pair.aws_key_pair.this[0] must be replaced
-/+ resource "aws_key_pair" "this" {
      ~ arn             = "arn:aws:ec2:us-east-1:322620855520:key-pair/ex-prod20240505144916900800000004" -> (known after apply)
      ~ fingerprint     = "15:bc:e9:39:84:29:ef:3b:20:2d:ac:fb:a8:ed:56:8f" -> (known after apply)
      ~ id              = "ex-prod20240505144916900800000004" -> (known after apply)
      ~ key_name        = "ex-prod20240505144916900800000004" -> (known after apply)
      ~ key_name_prefix = "ex-prod" -> "aws-eks-cluster" # forces replacement
      ~ key_pair_id     = "key-069df79cd48c3ff51" -> (known after apply)
      ~ key_type        = "rsa" -> (known after apply)
      ~ tags            = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          - "Name"       = "aws-eks-cluster" -> null
        }
      ~ tags_all        = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          - "Name"       = "aws-eks-cluster" -> null
        }
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_default_network_acl.this[0] will be updated in-place
  ~ resource "aws_default_network_acl" "this" {
        id                     = "acl-028ebe018e10e479c"
      ~ tags                   = {
          - "Environment" = "prod" -> null
          + "Example"     = "aws-eks-cluster"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
            "Name"        = "aws-eks-cluster-default"
          - "Terraform"   = "true" -> null
        }
      ~ tags_all               = {
          - "Environment" = "prod" -> null
          + "Example"     = "aws-eks-cluster"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          - "Terraform"   = "true" -> null
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vpc.aws_default_route_table.default[0] will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-026bd81ad69b439b8"
      ~ tags                   = {
          - "Environment" = "prod" -> null
          + "Example"     = "aws-eks-cluster"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
            "Name"        = "aws-eks-cluster-default"
          - "Terraform"   = "true" -> null
        }
      ~ tags_all               = {
          - "Environment" = "prod" -> null
          + "Example"     = "aws-eks-cluster"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          - "Terraform"   = "true" -> null
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_default_security_group.this[0] will be updated in-place
  ~ resource "aws_default_security_group" "this" {
        id                     = "sg-0316515a62b906e2e"
        name                   = "default"
      ~ tags                   = {
          - "Environment" = "prod" -> null
          + "Example"     = "aws-eks-cluster"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
            "Name"        = "aws-eks-cluster-default"
          - "Terraform"   = "true" -> null
        }
      ~ tags_all               = {
          - "Environment" = "prod" -> null
          + "Example"     = "aws-eks-cluster"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          - "Terraform"   = "true" -> null
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_egress_only_internet_gateway.this[0] will be created
  + resource "aws_egress_only_internet_gateway" "this" {
      + id       = (known after apply)
      + tags     = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "aws-eks-cluster"
        }
      + tags_all = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "aws-eks-cluster"
        }
      + vpc_id   = "vpc-00d0e04164e8b6ee2"
    }

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                       = "eipalloc-0ca58d2bd14130677"
      ~ tags                     = {
          - "Environment" = "prod" -> null
          + "Example"     = "aws-eks-cluster"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
            "Name"        = "aws-eks-cluster-us-east-1a"
          - "Terraform"   = "true" -> null
        }
      ~ tags_all                 = {
          - "Environment" = "prod" -> null
          + "Example"     = "aws-eks-cluster"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          - "Terraform"   = "true" -> null
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_eip" "nat" {
      - allocation_id            = "eipalloc-0d50b161830d0c1f2" -> null
      - association_id           = "eipassoc-0215b7ccd30a6a0b2" -> null
      - domain                   = "vpc" -> null
      - id                       = "eipalloc-0d50b161830d0c1f2" -> null
      - network_border_group     = "us-east-1" -> null
      - network_interface        = "eni-0c4acc46e04e6aa07" -> null
      - private_dns              = "ip-10-0-102-166.ec2.internal" -> null
      - private_ip               = "10.0.102.166" -> null
      - public_dns               = "ec2-18-207-82-199.compute-1.amazonaws.com" -> null
      - public_ip                = "18.207.82.199" -> null
      - public_ipv4_pool         = "amazon" -> null
      - tags                     = {
          - "Environment" = "prod"
          - "Name"        = "aws-eks-cluster-us-east-1b"
          - "Terraform"   = "true"
        } -> null
      - tags_all                 = {
          - "Environment" = "prod"
          - "Name"        = "aws-eks-cluster-us-east-1b"
          - "Terraform"   = "true"
        } -> null
      - vpc                      = true -> null
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[2] will be destroyed
  # (because index [2] is out of range for count)
  - resource "aws_eip" "nat" {
      - allocation_id            = "eipalloc-04a1d4bf84067a7b9" -> null
      - association_id           = "eipassoc-06b2aa141074e8057" -> null
      - domain                   = "vpc" -> null
      - id                       = "eipalloc-04a1d4bf84067a7b9" -> null
      - network_border_group     = "us-east-1" -> null
      - network_interface        = "eni-01b478b59afc8e213" -> null
      - private_dns              = "ip-10-0-103-232.ec2.internal" -> null
      - private_ip               = "10.0.103.232" -> null
      - public_dns               = "ec2-52-45-149-4.compute-1.amazonaws.com" -> null
      - public_ip                = "52.45.149.4" -> null
      - public_ipv4_pool         = "amazon" -> null
      - tags                     = {
          - "Environment" = "prod"
          - "Name"        = "aws-eks-cluster-us-east-1c"
          - "Terraform"   = "true"
        } -> null
      - tags_all                 = {
          - "Environment" = "prod"
          - "Name"        = "aws-eks-cluster-us-east-1c"
          - "Terraform"   = "true"
        } -> null
      - vpc                      = true -> null
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-078c001a39f9c758c"
      ~ tags     = {
          - "Environment" = "prod" -> null
          + "Example"     = "aws-eks-cluster"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
            "Name"        = "aws-eks-cluster"
          - "Terraform"   = "true" -> null
        }
      ~ tags_all = {
          - "Environment" = "prod" -> null
          + "Example"     = "aws-eks-cluster"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          - "Terraform"   = "true" -> null
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] must be replaced
-/+ resource "aws_nat_gateway" "this" {
      ~ association_id                     = "eipassoc-0587cd023eae0b5ae" -> (known after apply)
      ~ id                                 = "nat-0a96cc160b2a1c4f0" -> (known after apply)
      ~ network_interface_id               = "eni-02fa1b166a13d071e" -> (known after apply)
      ~ private_ip                         = "10.0.101.153" -> (known after apply)
      ~ public_ip                          = "174.129.210.243" -> (known after apply)
      - secondary_allocation_ids           = [] -> null
      ~ secondary_private_ip_address_count = 0 -> (known after apply)
      ~ secondary_private_ip_addresses     = [] -> (known after apply)
      ~ subnet_id                          = "subnet-0393d1295f29264d2" # forces replacement -> (known after apply) # forces replacement
      ~ tags                               = {
          - "Environment" = "prod" -> null
          + "Example"     = "aws-eks-cluster"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
            "Name"        = "aws-eks-cluster-us-east-1a"
          - "Terraform"   = "true" -> null
        }
      ~ tags_all                           = {
          - "Environment" = "prod" -> null
          + "Example"     = "aws-eks-cluster"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          - "Terraform"   = "true" -> null
            # (1 unchanged element hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_nat_gateway" "this" {
      - allocation_id                      = "eipalloc-0d50b161830d0c1f2" -> null
      - association_id                     = "eipassoc-0215b7ccd30a6a0b2" -> null
      - connectivity_type                  = "public" -> null
      - id                                 = "nat-023101d96776e16d7" -> null
      - network_interface_id               = "eni-0c4acc46e04e6aa07" -> null
      - private_ip                         = "10.0.102.166" -> null
      - public_ip                          = "18.207.82.199" -> null
      - secondary_allocation_ids           = [] -> null
      - secondary_private_ip_address_count = 0 -> null
      - secondary_private_ip_addresses     = [] -> null
      - subnet_id                          = "subnet-0f78c4569a594a708" -> null
      - tags                               = {
          - "Environment" = "prod"
          - "Name"        = "aws-eks-cluster-us-east-1b"
          - "Terraform"   = "true"
        } -> null
      - tags_all                           = {
          - "Environment" = "prod"
          - "Name"        = "aws-eks-cluster-us-east-1b"
          - "Terraform"   = "true"
        } -> null
    }

  # module.vpc.aws_nat_gateway.this[2] will be destroyed
  # (because index [2] is out of range for count)
  - resource "aws_nat_gateway" "this" {
      - allocation_id                      = "eipalloc-04a1d4bf84067a7b9" -> null
      - association_id                     = "eipassoc-06b2aa141074e8057" -> null
      - connectivity_type                  = "public" -> null
      - id                                 = "nat-0c650e942075a1f4d" -> null
      - network_interface_id               = "eni-01b478b59afc8e213" -> null
      - private_ip                         = "10.0.103.232" -> null
      - public_ip                          = "52.45.149.4" -> null
      - secondary_allocation_ids           = [] -> null
      - secondary_private_ip_address_count = 0 -> null
      - secondary_private_ip_addresses     = [] -> null
      - subnet_id                          = "subnet-07bd5238272ea6797" -> null
      - tags                               = {
          - "Environment" = "prod"
          - "Name"        = "aws-eks-cluster-us-east-1c"
          - "Terraform"   = "true"
        } -> null
      - tags_all                           = {
          - "Environment" = "prod"
          - "Name"        = "aws-eks-cluster-us-east-1c"
          - "Terraform"   = "true"
        } -> null
    }

  # module.vpc.aws_route.private_dns64_nat_gateway[0] will be created
  + resource "aws_route" "private_dns64_nat_gateway" {
      + destination_ipv6_cidr_block = "64:ff9b::/96"
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = "rtb-0a8fecc0fef170da8"
      + state                       = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_ipv6_egress[0] will be created
  + resource "aws_route" "private_ipv6_egress" {
      + destination_ipv6_cidr_block = "::/0"
      + egress_only_gateway_id      = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = "rtb-0a8fecc0fef170da8"
      + state                       = (known after apply)
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be updated in-place
  ~ resource "aws_route" "private_nat_gateway" {
        id                          = "r-rtb-0a8fecc0fef170da81080289494"
      ~ nat_gateway_id              = "nat-0a96cc160b2a1c4f0" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_route" "private_nat_gateway" {
      - destination_cidr_block      = "0.0.0.0/0" -> null
      - id                          = "r-rtb-01cb136a9f631e17c1080289494" -> null
      - nat_gateway_id              = "nat-023101d96776e16d7" -> null
      - origin                      = "CreateRoute" -> null
      - route_table_id              = "rtb-01cb136a9f631e17c" -> null
      - state                       = "active" -> null
        # (13 unchanged attributes hidden)

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.aws_route.private_nat_gateway[2] will be destroyed
  # (because index [2] is out of range for count)
  - resource "aws_route" "private_nat_gateway" {
      - destination_cidr_block      = "0.0.0.0/0" -> null
      - id                          = "r-rtb-015157ef0c2fb9b381080289494" -> null
      - nat_gateway_id              = "nat-0c650e942075a1f4d" -> null
      - origin                      = "CreateRoute" -> null
      - route_table_id              = "rtb-015157ef0c2fb9b38" -> null
      - state                       = "active" -> null
        # (13 unchanged attributes hidden)

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.aws_route.public_internet_gateway_ipv6[0] will be created
  + resource "aws_route" "public_internet_gateway_ipv6" {
      + destination_ipv6_cidr_block = "::/0"
      + gateway_id                  = "igw-078c001a39f9c758c"
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = "rtb-0f584ee235af30c6b"
      + state                       = (known after apply)
    }

  # module.vpc.aws_route_table.intra[0] will be created
  + resource "aws_route_table" "intra" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "aws-eks-cluster-intra"
        }
      + tags_all         = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "aws-eks-cluster-intra"
        }
      + vpc_id           = "vpc-00d0e04164e8b6ee2"
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0a8fecc0fef170da8"
      ~ tags             = {
          - "Environment" = "prod" -> null
          + "Example"     = "aws-eks-cluster"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          ~ "Name"        = "aws-eks-cluster-private-us-east-1a" -> "aws-eks-cluster-private"
          - "Terraform"   = "true" -> null
        }
      ~ tags_all         = {
          - "Environment" = "prod" -> null
          + "Example"     = "aws-eks-cluster"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          ~ "Name"        = "aws-eks-cluster-private-us-east-1a" -> "aws-eks-cluster-private"
          - "Terraform"   = "true" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] will be destroyed
  # (because index [1] is out of range for count)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:322620855520:route-table/rtb-01cb136a9f631e17c" -> null
      - id               = "rtb-01cb136a9f631e17c" -> null
      - owner_id         = "322620855520" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - cidr_block                 = "0.0.0.0/0"
              - nat_gateway_id             = "nat-023101d96776e16d7"
                # (11 unchanged attributes hidden)
            },
        ] -> null
      - tags             = {
          - "Environment" = "prod"
          - "Name"        = "aws-eks-cluster-private-us-east-1b"
          - "Terraform"   = "true"
        } -> null
      - tags_all         = {
          - "Environment" = "prod"
          - "Name"        = "aws-eks-cluster-private-us-east-1b"
          - "Terraform"   = "true"
        } -> null
      - vpc_id           = "vpc-00d0e04164e8b6ee2" -> null
    }

  # module.vpc.aws_route_table.private[2] will be destroyed
  # (because index [2] is out of range for count)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:322620855520:route-table/rtb-015157ef0c2fb9b38" -> null
      - id               = "rtb-015157ef0c2fb9b38" -> null
      - owner_id         = "322620855520" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - cidr_block                 = "0.0.0.0/0"
              - nat_gateway_id             = "nat-0c650e942075a1f4d"
                # (11 unchanged attributes hidden)
            },
        ] -> null
      - tags             = {
          - "Environment" = "prod"
          - "Name"        = "aws-eks-cluster-private-us-east-1c"
          - "Terraform"   = "true"
        } -> null
      - tags_all         = {
          - "Environment" = "prod"
          - "Name"        = "aws-eks-cluster-private-us-east-1c"
          - "Terraform"   = "true"
        } -> null
      - vpc_id           = "vpc-00d0e04164e8b6ee2" -> null
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0f584ee235af30c6b"
      ~ tags             = {
          - "Environment" = "prod" -> null
          + "Example"     = "aws-eks-cluster"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
            "Name"        = "aws-eks-cluster-public"
          - "Terraform"   = "true" -> null
        }
      ~ tags_all         = {
          - "Environment" = "prod" -> null
          + "Example"     = "aws-eks-cluster"
          + "GithubOrg"   = "terraform-aws-modules"
          + "GithubRepo"  = "terraform-aws-eks"
          - "Terraform"   = "true" -> null
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.intra[0] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.intra[1] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.intra[2] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-0424935ee7a4af559" -> (known after apply)
      ~ subnet_id      = "subnet-042c6bd1a2a15a8cf" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.private[1] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-08f5715b53bb53b42" -> (known after apply)
      ~ route_table_id = "rtb-01cb136a9f631e17c" -> "rtb-0a8fecc0fef170da8"
      ~ subnet_id      = "subnet-0b8777df01db3bf68" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.private[2] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-00b2c5d3df346a651" -> (known after apply)
      ~ route_table_id = "rtb-015157ef0c2fb9b38" -> "rtb-0a8fecc0fef170da8"
      ~ subnet_id      = "subnet-08b01043cc3f0b294" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_route_table_association.public[0] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-011bb800fc1a3d8cd" -> (known after apply)
      ~ subnet_id      = "subnet-0393d1295f29264d2" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.public[1] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-0f35588ae3b133c30" -> (known after apply)
      ~ subnet_id      = "subnet-0f78c4569a594a708" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.public[2] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-05c60f0f7769faa8f" -> (known after apply)
      ~ subnet_id      = "subnet-07bd5238272ea6797" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.intra[0] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = true
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.52.0/24"
      + enable_dns64                                   = true
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = true
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "aws-eks-cluster-intra-us-east-1a"
        }
      + tags_all                                       = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "aws-eks-cluster-intra-us-east-1a"
        }
      + vpc_id                                         = "vpc-00d0e04164e8b6ee2"
    }

  # module.vpc.aws_subnet.intra[1] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = true
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.53.0/24"
      + enable_dns64                                   = true
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = true
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "aws-eks-cluster-intra-us-east-1b"
        }
      + tags_all                                       = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "aws-eks-cluster-intra-us-east-1b"
        }
      + vpc_id                                         = "vpc-00d0e04164e8b6ee2"
    }

  # module.vpc.aws_subnet.intra[2] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = true
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.54.0/24"
      + enable_dns64                                   = true
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = true
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "aws-eks-cluster-intra-us-east-1c"
        }
      + tags_all                                       = {
          + "Example"    = "aws-eks-cluster"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
          + "Name"       = "aws-eks-cluster-intra-us-east-1c"
        }
      + vpc_id                                         = "vpc-00d0e04164e8b6ee2"
    }

  # module.vpc.aws_subnet.private[0] must be replaced
+/- resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:322620855520:subnet/subnet-042c6bd1a2a15a8cf" -> (known after apply)
      ~ assign_ipv6_address_on_creation                = false -> true
      ~ availability_zone_id                           = "use1-az4" -> (known after apply)
      ~ cidr_block                                     = "10.0.1.0/24" -> "10.0.0.0/20" # forces replacement
      ~ enable_dns64                                   = false -> true
      - enable_lni_at_device_index                     = 0 -> null
      ~ enable_resource_name_dns_aaaa_record_on_launch = false -> true
      ~ id                                             = "subnet-042c6bd1a2a15a8cf" -> (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "322620855520" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          - "Environment"                     = "prod" -> null
          + "Example"                         = "aws-eks-cluster"
          + "GithubOrg"                       = "terraform-aws-modules"
          + "GithubRepo"                      = "terraform-aws-eks"
            "Name"                            = "aws-eks-cluster-private-us-east-1a"
          - "Terraform"                       = "true" -> null
          + "kubernetes.io/role/internal-elb" = "1"
        }
      ~ tags_all                                       = {
          - "Environment"                     = "prod" -> null
          + "Example"                         = "aws-eks-cluster"
          + "GithubOrg"                       = "terraform-aws-modules"
          + "GithubRepo"                      = "terraform-aws-eks"
          - "Terraform"                       = "true" -> null
          + "kubernetes.io/role/internal-elb" = "1"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] must be replaced
+/- resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:322620855520:subnet/subnet-0b8777df01db3bf68" -> (known after apply)
      ~ assign_ipv6_address_on_creation                = false -> true
      ~  ... 

```
</details>
Output is too long and was truncated. Full output can be found <a href="https://github.com/caiocsgomes/aws-eks-cluster/actions/runs/8960879582">here</a><br><br>